---
kind: type
id: T:Autodesk.Revit.Exceptions.DirectoryNotFoundException
source: html/e6614e11-0fd4-df20-0d2d-02722b779128.htm
---
# Autodesk.Revit.Exceptions.DirectoryNotFoundException

The exception that is thrown when the specified directory could not be found.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class DirectoryNotFoundException : IOException
```